Revit 2026 API

# UIMacroManager Properties

---

The UIMacroManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroManager | The DB macro manager. |

#### Reference

UIMacroManager Class

Autodesk.Revit.UI.Macros Namespace